# üçΩÔ∏è Case Study #1 - Danny's Diner

### Problem Statement

We're here to help Danny with his restaurant by providing insights using some data he has gathered.

Danny wants to use the data to answer a few simple questions about his customers, especially about their visiting patterns, how much money they‚Äôve spent and also which menu items are their favourite. Having this deeper connection with his customers will help him deliver a better and more personalised experience for his loyal customers.

Danny has shared with us 3 key datasets for this case study:

Table 1: `sales`
| customer_id | order_date | product_id |
|:-----------:|:----------:|:----------:|
| A           | 2021-01-01 | 1          |
| A           | 2021-01-01 | 2          |
| A           | 2021-01-07 | 2          |
| A           | 2021-01-10 | 3          |
| A           | 2021-01-11 | 3          |
| A           | 2021-01-11 | 3          |
| B           | 2021-01-01 | 2          |
| B           | 2021-01-02 | 2          |
| B           | 2021-01-04 | 1          |
| B           | 2021-01-11 | 1          |
| B           | 2021-01-16 | 3          |
| B           | 2021-02-01 | 3          |
| C           | 2021-01-01 | 3          |
| C           | 2021-01-01 | 3          |
| C           | 2021-01-07 | 3          |

Table 2: `menu`
| product_id | product_name | price |
|:----------:|:------------:|:-----:|
| 1          | sushi        | 10    |
| 2          | curry        | 15    |
| 3          | ramen        | 12    |

Table 3: `members`
| customer_id |  join_date |
|:-----------:|:----------:|
| A           | 2021-01-07 |
| B           | 2021-01-09 |


[See the original here](https://8weeksqlchallenge.com/case-study-1/)

----

### Questions:
1. What is the total amount each customer spent at the restaurant?
2. How many days has each customer visited the restaurant?
3. What was the first item from the menu purchased by each customer?
4. What is the most purchased item on the menu and how many times was it purchased by all customers?
5. Which item was the most popular for each customer?
6. Which item was purchased first by the customer after they became a member?
7. Which item was purchased just before the customer became a member?
8. What is the total items and amount spent for each member before they became a member?
9. If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?
10. In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?

In [124]:
%load_ext sql
from sqlalchemy import create_engine
from dotenv import load_dotenv
import os

# Loading environment variables from .env file
load_dotenv()
# Starting sqlalchemy engine
engine = create_engine(f'postgresql+psycopg2://neyas:{os.environ["postgresql_password"]}@localhost/dannys_diner')

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [125]:
%sql engine

#### 1. What is the total amount each customer spent at the restaurant?

In [126]:
%%sql
SELECT customer_id, SUM(price) as price
FROM dannys_diner.sales as s
LEFT JOIN dannys_diner.menu as m
ON s.product_id = m.product_id
GROUP BY customer_id
ORDER BY customer_id;

Running query in 'postgresql+psycopg2://neyas:***@localhost/dannys_diner'

3 rows affected.

+-------------+-------+
| customer_id | price |
+-------------+-------+
|      A      |   76  |
|      B      |   74  |
|      C      |   36  |
+-------------+-------+

#### 2. How many days has each customer visited the restaurant?

In [127]:
%%sql
SELECT customer_id, COUNT(DISTINCT order_date)
FROM dannys_diner.sales
GROUP BY customer_id;

Running query in 'postgresql+psycopg2://neyas:***@localhost/dannys_diner'

3 rows affected.

+-------------+-------+
| customer_id | count |
+-------------+-------+
|      A      |   4   |
|      B      |   6   |
|      C      |   2   |
+-------------+-------+

#### What was the first item from the menu purchased by each customer?

In [128]:
%%sql
WITH sales_ranked AS (SELECT
    customer_id,
    order_date,
    DENSE_RANK() OVER(PARTITION BY customer_id ORDER BY order_date ASC) as rank,
    product_id
FROM dannys_diner.sales)

SELECT
    DISTINCT customer_id,
    product_id
FROM sales_ranked
WHERE rank = 1;

Running query in 'postgresql+psycopg2://neyas:***@localhost/dannys_diner'

4 rows affected.

+-------------+------------+
| customer_id | product_id |
+-------------+------------+
|      A      |     1      |
|      A      |     2      |
|      B      |     2      |
|      C      |     3      |
+-------------+------------+

#### What is the most purchased item on the menu and how many times was it purchased by all customers?

In [130]:
%%sql
SELECT
    m.product_name,
    COUNT(s.product_id) as orders
FROM dannys_diner.sales as s
LEFT JOIN dannys_diner.menu as m
ON s.product_id = m.product_id
GROUP BY m.product_name
ORDER BY orders DESC
LIMIT 1;

Running query in 'postgresql+psycopg2://neyas:***@localhost/dannys_diner'

1 rows affected.

+--------------+--------+
| product_name | orders |
+--------------+--------+
|    ramen     |   8    |
+--------------+--------+

#### Which item was the most popular for each customer?

In [131]:
%%sql
WITH ranked_sales AS (SELECT 
    customer_id,
    product_id,
    COUNT(product_id) as orders,
    DENSE_RANK() OVER(PARTITION BY customer_id ORDER BY COUNT(customer_id) DESC) as rank
FROM dannys_diner.sales
GROUP BY customer_id, product_id
ORDER BY customer_id, rank)

SELECT
    r.customer_id,
    product_name,
    orders
FROM ranked_sales as r
LEFT JOIN dannys_diner.menu as m
ON r.product_id = m.product_id
WHERE rank = 1
ORDER BY customer_id;

Running query in 'postgresql+psycopg2://neyas:***@localhost/dannys_diner'

5 rows affected.

+-------------+--------------+--------+
| customer_id | product_name | orders |
+-------------+--------------+--------+
|      A      |    ramen     |   3    |
|      B      |    sushi     |   2    |
|      B      |    curry     |   2    |
|      B      |    ramen     |   2    |
|      C      |    ramen     |   3    |
+-------------+--------------+--------+

#### Which item was purchased first by the customer after they became a member?

In [182]:
%%sql
WITH first_order AS (SELECT
    DISTINCT ON (s.customer_id) s.customer_id,
    s.product_id,
    MIN(order_date) as order_date
FROM dannys_diner.sales as s
RIGHT JOIN dannys_diner.members as m
ON s.customer_id = m.customer_id
WHERE order_date >= join_date
GROUP BY s.customer_id, s.product_id
ORDER BY customer_id, order_date ASC)

SELECT
    customer_id,
    product_name
FROM first_order as f
LEFT JOIN dannys_diner.menu as menu
ON f.product_id = menu.product_id
ORDER BY customer_id;

Running query in 'postgresql+psycopg2://neyas:***@localhost/dannys_diner'

2 rows affected.

+-------------+--------------+
| customer_id | product_name |
+-------------+--------------+
|      A      |    curry     |
|      B      |    sushi     |
+-------------+--------------+

#### Which item was purchased just before the customer became a member?

In [188]:
%%sql
WITH last_order AS (SELECT
    DISTINCT ON (s.customer_id) s.customer_id,
    s.product_id,
    MAX(order_date) as order_date
FROM dannys_diner.sales as s
RIGHT JOIN dannys_diner.members as m
ON s.customer_id = m.customer_id
WHERE order_date < join_date
GROUP BY s.customer_id, s.product_id
ORDER BY customer_id, order_date DESC)

SELECT
    customer_id,
    product_name
FROM last_order as l
LEFT JOIN dannys_diner.menu as menu
ON l.product_id = menu.product_id
ORDER BY customer_id;

Running query in 'postgresql+psycopg2://neyas:***@localhost/dannys_diner'

2 rows affected.

+-------------+--------------+
| customer_id | product_name |
+-------------+--------------+
|      A      |    sushi     |
|      B      |    sushi     |
+-------------+--------------+

#### What is the total items and amount spent for each member before they became a member?

In [199]:
%%sql
SELECT
    s.customer_id,
    COUNT(s.customer_id) as items_purchased,
    SUM(price) as total_spent
FROM dannys_diner.sales as s
LEFT JOIN dannys_diner.menu as m
ON s.product_id = m.product_id
LEFT JOIN dannys_diner.members as mem
ON s.customer_id = mem.customer_id
WHERE join_date IS NULL
OR order_date < join_date
GROUP BY s.customer_id
ORDER BY customer_id;

Running query in 'postgresql+psycopg2://neyas:***@localhost/dannys_diner'

3 rows affected.

+-------------+-----------------+-------------+
| customer_id | items_purchased | total_spent |
+-------------+-----------------+-------------+
|      A      |        2        |      25     |
|      B      |        3        |      40     |
|      C      |        3        |      36     |
+-------------+-----------------+-------------+

#### If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?

In [206]:
%%sql
SELECT
    customer_id,
    SUM(points) as points
FROM dannys_diner.sales as s
LEFT JOIN (
    SELECT 
        product_id,
        price,
        CASE WHEN product_id = 1 THEN price * 20
        ELSE price * 10
        END as points
    FROM dannys_diner.menu
    ) as points_menu
ON s.product_id = points_menu.product_id
GROUP BY customer_id
ORDER BY customer_id;

Running query in 'postgresql+psycopg2://neyas:***@localhost/dannys_diner'

3 rows affected.

+-------------+--------+
| customer_id | points |
+-------------+--------+
|      A      |  860   |
|      B      |  940   |
|      C      |  360   |
+-------------+--------+

#### In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?

In [225]:
%%sql
WITH points_menu AS (
    SELECT 
        product_id,
        price,
        CASE WHEN product_id = 1 THEN price * 20
        ELSE price * 10
        END as points
    FROM dannys_diner.menu),

jan_adjusted_points AS (SELECT 
    s.customer_id,
    join_date,
    order_date,
    s.product_id,
    pm.points,
    CASE WHEN order_date BETWEEN join_date AND join_date + INTERVAL '7 day' THEN points * 2
    ELSE points END as member_points
FROM dannys_diner.sales as s
LEFT JOIN points_menu as pm
ON s.product_id = pm.product_id
LEFT JOIN dannys_diner.members as mem
ON s.customer_id = mem.customer_id
WHERE s.customer_id IN (SELECT customer_id FROM dannys_diner.members)
AND order_date < '2021-02-01'
ORDER BY s.customer_id, order_date)

SELECT
    customer_id,
    SUM(member_points)
FROM jan_adjusted_points
GROUP BY customer_id;

Running query in 'postgresql+psycopg2://neyas:***@localhost/dannys_diner'

2 rows affected.

+-------------+------+
| customer_id | sum  |
+-------------+------+
|      A      | 1370 |
|      B      | 1140 |
+-------------+------+